## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:91" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:91" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:a83fe62aa7316709cc7704caf556db0753e2f28f98430209edac32918bc130d0" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:df7ea3cfa01e93f65fc4f39dd413d4264bbe6d7caef6828373dd7cda9bc3c59d"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 91 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql must be replaced
+/- resource "aws_s3_object" "lambda_artifact-graphql" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/graphql.938984eea36f7f37854f599588f82097.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "0603923bf51900b3ccf4f930b3d340f0-6" -> "36a5f7cf9c42d57c15cc6cb74a000c36"
      ~ id                     = "graphql.938984eea36f7f37854f599588f82097.zip" -> (known after apply)
      ~ key                    = "graphql.938984eea36f7f37854f599588f82097.zip" -> "graphql.36a5f7cf9c42d57c15cc6cb74a000c36.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "938984eea36f7f37854f599588f82097" -> "36a5f7cf9c42d57c15cc6cb74a000c36"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "f5BTm.a7cgpGsljJpJF48gA_7_fW5zp0" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "c31b368cf036d6e1e9bb0543d2d9a8aa-5" -> "b8273fdb4bc8f0ae6540ab69af44ff94"
        id                     = "processValidationJson.b8273fdb4bc8f0ae6540ab69af44ff94.zip"
        tags                   = {}
      ~ version_id             = "1zQZ535g_OKXOtJdlM6XT8WITORxKSto" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.fa70ebe51a84e924f5a3b35b673748f7.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "d6ef98aa0795b23ebcf12e600cd8da7f-4" -> "36bf9cdfe29516ba4a349fef873fa5b2"
      ~ id                     = "python.fa70ebe51a84e924f5a3b35b673748f7.zip" -> (known after apply)
      ~ key                    = "python.fa70ebe51a84e924f5a3b35b673748f7.zip" -> "python.36bf9cdfe29516ba4a349fef873fa5b2.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "fa70ebe51a84e924f5a3b35b673748f7" -> "36bf9cdfe29516ba4a349fef873fa5b2"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "vIXDTxfZJTpaKv75dqKATy5TKFdrrEJY" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "c5519142000c588a18fbc53d3a992faa" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/200.html"
      ~ source_hash            = "c5519142000c588a18fbc53d3a992faa" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "BVzmPdWPlXj5Y0BXcOiMpW98fhpDRw2b" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "505c8aa2f4be923dd75906f886899245" -> "60867b05c87877a1b51a4b98c9a37c68"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "505c8aa2f4be923dd75906f886899245" -> "60867b05c87877a1b51a4b98c9a37c68"
        tags                   = {}
      ~ version_id             = "bYKRBMHl8go3uZ5T95_q0Cls_5qY7fFl" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "a54a6e2f878d2c96e57c500fc4c7e145" -> "9523f2185ba82b988bbd2521fefab528"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "a54a6e2f878d2c96e57c500fc4c7e145" -> "9523f2185ba82b988bbd2521fefab528"
        tags                   = {}
      ~ version_id             = "wGtGQ6eEhIP4Q2V5QFlDsVP6HOLYI5g5" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "c5519142000c588a18fbc53d3a992faa" -> "28563af05ece3beb5f6e35ec6849ae5b"
        id                     = "dist/index.html"
      ~ source_hash            = "c5519142000c588a18fbc53d3a992faa" -> "28563af05ece3beb5f6e35ec6849ae5b"
        tags                   = {}
      ~ version_id             = "_MYoOwxi.lsLZaklB7Za1slsf4dGDYSA" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.13f99893.chunk.js"] will be destroyed
  # (because key ["static/js/UploadUploadPage.13f99893.chunk.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.13f99893.chunk.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "d3731dd001084a6bf362918a8396cfca" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.13f99893.chunk.js" -> null
-       key                    = "dist/static/js/UploadUploadPage.13f99893.chunk.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.13f99893.chunk.js" -> null
-       source_hash            = "d3731dd001084a6bf362918a8396cfca" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "GGsCABmFZtYs7fe4OzUDdsE1rVjT0gyJ" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "efea1edc51440599026956ce53a048e0" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.13f99893.chunk.js.LICENSE.txt" -> null
-       source_hash            = "efea1edc51440599026956ce53a048e0" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PiqeiXhoe0E0Ma2HvgVnam5Rqrn8317y" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.e2882995.chunk.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "dce32306d44e255a23e0e85e9cca7246"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.e2882995.chunk.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.e2882995.chunk.js"
+       source_hash            = "dce32306d44e255a23e0e85e9cca7246"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/UploadUploadPage.e2882995.chunk.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "efea1edc51440599026956ce53a048e0"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/UploadUploadPage.e2882995.chunk.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/UploadUploadPage.e2882995.chunk.js.LICENSE.txt"
+       source_hash            = "efea1edc51440599026956ce53a048e0"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "cbe21e685ada3914355be4b695f19430"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js"
+       source_hash            = "cbe21e685ada3914355be4b695f19430"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.20ad7183.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "b703266ba347d460c07ac79899e011fa"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.20ad7183.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.20ad7183.js.LICENSE.txt"
+       source_hash            = "b703266ba347d460c07ac79899e011fa"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.65d69369.js"] will be destroyed
  # (because key ["static/js/app.65d69369.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.65d69369.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "774bf86e6480f6a0fec089c697dd54c1" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.65d69369.js" -> null
-       key                    = "dist/static/js/app.65d69369.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.65d69369.js" -> null
-       source_hash            = "774bf86e6480f6a0fec089c697dd54c1" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Bf2xi4IifIj4JyHL42JIOphEudlCeQHu" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.65d69369.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.65d69369.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.65d69369.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "b703266ba347d460c07ac79899e011fa" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.65d69369.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.65d69369.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.65d69369.js.LICENSE.txt" -> null
-       source_hash            = "b703266ba347d460c07ac79899e011fa" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "YQiOjdNJEJ0qw.5YkCIohCCF5dmKtAJh" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.2ab8a0b8.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "01bae23199930c935a28fd5869ae8da1"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/runtime-app.2ab8a0b8.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.2ab8a0b8.js"
+       source_hash            = "01bae23199930c935a28fd5869ae8da1"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/runtime-app.34ce84de.js"] will be destroyed
  # (because key ["static/js/runtime-app.34ce84de.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/runtime-app.34ce84de.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "f7bbdf6a0cd6eac713b31a3d17c0c190" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/runtime-app.34ce84de.js" -> null
-       key                    = "dist/static/js/runtime-app.34ce84de.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/runtime-app.34ce84de.js" -> null
-       source_hash            = "f7bbdf6a0cd6eac713b31a3d17c0c190" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "PJ9uWlmBVJY5rwK_1qfmqQyr5E7NITFf" -> null
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-04-12T21:02:17.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:58" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:58/invocations" -> (known after apply)
      ~ s3_key                         = "python.fa70ebe51a84e924f5a3b35b673748f7.zip" -> "python.36bf9cdfe29516ba4a349fef873fa5b2.zip"
        tags                           = {}
      ~ version                        = "58" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
              ~ "DD_TAGS"                      = "git.commit.sha:a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "58" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ last_modified                  = "2024-04-12T21:02:04.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:106" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:106/invocations" -> (known after apply)
      ~ s3_key                         = "graphql.938984eea36f7f37854f599588f82097.zip" -> "graphql.36a5f7cf9c42d57c15cc6cb74a000c36.zip"
        tags                           = {}
      ~ version                        = "106" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
              ~ "DD_TAGS"                            = "git.commit.sha:a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
                # (17 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "106" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:14" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:14/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "14" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
              ~ "DD_TAGS"                      = "git.commit.sha:a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "a11c6a75cbdd5c60b5e2eb66d8ecd2ea99ec86f5" -> "ad30c33e681e6fc3407ebf9d2a1e4bc3032ce5e9"
                # (13 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "14" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 11 to add, 9 to change, 11 to destroy.
```

</details>

*Pusher: @jakekreider, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8681829153)*